frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_tmr.c
/*!
 * @file        apm32l0xx_tmr.c
 *
 * @brief       This file provides all the TMR firmware functions.
 *
 * @version     V1.0.0
 *
 * @date        2021-12-25
 *
 * @attention
 *
 *  Copyright (C) 2020-2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32l0xx_tmr.h"
#include "apm32l0xx_rcm.h"

/** @addtogroup Peripherals_Library Standard Peripheral Library
  @{
*/

/** @addtogroup TMR_Driver  TMR Driver
  @{
*/

/** @addtogroup  TMR_Fuctions Fuctions
  @{
*/

static void TI1Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter);
static void TI2Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter);
static void TI3Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter);
static void TI4Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter);

/*!
 * @brief     Deinitializes the TMRx peripheral registers to their default reset values.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    None
 *
 * @note
 */
void TMR_Reset(TMR_T* tmr)
{
    if (tmr == TMR21)
    {
    RCM_EnableAPB2PeriphReset(RCM_APB2_PERIPH_TMR21);
    RCM_DisableAPB2PeriphReset(RCM_APB2_PERIPH_TMR21);
    }
    else if (tmr == TMR2)
    {
    RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_TMR2);
    RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_TMR2);
    }
    else if (tmr == TMR3)
    {
    RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_TMR3);
    RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_TMR3);
    }
    else if (tmr == TMR6)
    {
    RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_TMR6);
    RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_TMR6);
    }
    else if (tmr == TMR7)
    {
    RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_TMR7);
    RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_TMR7);
    }
    else if (tmr == TMR22)
    {
    RCM_EnableAPB2PeriphReset(RCM_APB2_PERIPH_TMR22);
    RCM_DisableAPB2PeriphReset(RCM_APB2_PERIPH_TMR22);
    }
}

/*!
 * @brief     Initializes the base timer through the structure
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     baseConfig: Pointer to a TMR_BaseConfig_T structure
 *
 * @retval    None
 */
void TMR_ConfigTimeBase(TMR_T* tmr, TMR_BaseConfig_T* baseConfig)
{
    uint16_t temp1 = 0;

    temp1 = tmr->CTRL1;

    temp1 &= 0x038F;
    temp1 |= baseConfig->countMode;

    temp1 &= 0x00FF;
    temp1 |= baseConfig->clockDivision;

    tmr->CTRL1 = temp1;

    tmr->AUTORLD = baseConfig->period ;

    tmr->PSC = baseConfig->division;

    tmr->CEG_B.UEG = TMR_PRESCALER_RELOAD_IMMEDIATE;
}

/*!
 * @brief     Initialize the Base timer with its default value.
 *
 * @param     baseConfig: pointer to a TMR_BaseConfig_T
 *
 * @retval    None
 */
void TMR_ConfigTimeBaseStructInit(TMR_BaseConfig_T* baseConfig)
{
    baseConfig->countMode = TMR_COUNTER_MODE_UP;
    baseConfig->clockDivision = TMR_CLOCK_DIV_1;
    baseConfig->period = 0xFFFF;
    baseConfig->division = 0x0000;
}

/*!
 * @brief     Configures the TMRx Prescaler
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     prescaler: specifies the Prescaler Register value
 *
 * @param     pscReloadMode: specifies the TMR Prescaler Reload mode
 *            The parameter can be one of following values:
 *            @arg TMR_PRESCALER_RELOAD_UPDATE   : The Prescaler is loaded at the update event
 *            @arg TMR_PRESCALER_RELOAD_IMMEDIATE: The Prescaler is loaded immediately
 *
 * @retval    None
 */
void TMR_ConfigPrescaler(TMR_T* tmr, uint16_t prescaler, TMR_PRESCALER_RELOAD_T pscReloadMode)
{
    tmr->PSC = prescaler;
    tmr->CEG_B.UEG = pscReloadMode;
}

/*!
 * @brief     Config counter mode
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     countMode:specifies the Counter Mode to be used
 *            The parameter can be one of following values:
 *            @arg TMR_COUNTER_MODE_UP            : Timer Up Counting Mode
 *            @arg TMR_COUNTER_MODE_DOWN          : Timer Down Counting Mode
 *            @arg TMR_COUNTER_MODE_CENTERALIGNED1: Timer Center Aligned Mode1
 *            @arg TMR_COUNTER_MODE_CENTERALIGNED2: Timer Center Aligned Mode2
 *            @arg TMR_COUNTER_MODE_CENTERALIGNED3: Timer Center Aligned Mode3
 *
 * @retval    None
 */
void TMR_ConfigCounterMode(TMR_T* tmr, TMR_COUNTER_MODE_T countMode)
{
    tmr->CTRL1_B.CNTDIR = BIT_RESET;
    tmr->CTRL1_B.CAMSEL = BIT_RESET;
    tmr->CTRL1 |= countMode;
}

/*!
 * @brief     Configs the Counter Register value
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     counter: Counter register new value
 *
 * @retval    None
 */
void TMR_ConfigCounter(TMR_T* tmr, uint16_t counter)
{
    tmr->CNT = counter;
}

/*!
 * @brief     Configs the AutoReload Register value
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     autoReload: autoReload register new value
 *
 * @retval    None
 */
void TMR_ConfigAutoreload(TMR_T* tmr, uint16_t autoReload)
{
    tmr->AUTORLD = autoReload;
}

/*!
 * @brief     Read the TMRx Counter value.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    Counter Register value.
 */
uint16_t TMR_ReadCounter(TMR_T* tmr)
{
    return tmr->CNT;
}

/*!
 * @brief     Read the TMRx  Prescaler value.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    Prescaler Register value.
 */
uint16_t TMR_ReadPrescaler(TMR_T* tmr)
{
    return tmr->PSC;
}

/*!
 * @brief     Enable the TMRx update event
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    None
 */
void TMR_EnableNoUpdate(TMR_T* tmr)
{
    tmr->CTRL1_B.UD = ENABLE;
}

/*!
 * @brief     Disable the TMRx update event
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    None
 */
void TMR_DisableNoUpdate(TMR_T* tmr)
{
    tmr->CTRL1_B.UD = DISABLE;
}

/*!
 * @brief     Configures the Update Request Interrupt source
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     updateSource: Config the Update source
 *            The parameter can be one of following values:
 *            @arg TMR_UPDATE_SOURCE_GLOBAL
 *            @arg TMR_UPDATE_SOURCE_REGULAR
 *
 * @retval    None
 */
void TMR_ConfigUpdateRequest(TMR_T* tmr, TMR_UPDATE_SOURCE_T updateSource)
{
    if (updateSource != TMR_UPDATE_SOURCE_GLOBAL)
    {
        tmr->CTRL1_B.URSSEL = BIT_SET;
    }
    else
    {
        tmr->CTRL1_B.URSSEL = BIT_RESET;
    }
}

/*!
 * @brief     Enables peripheral Preload register on AUTORLD.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    None
 */
void TMR_EnableAutoReload(TMR_T* tmr)
{
    tmr->CTRL1_B.ARPEN = ENABLE;
}

/*!
 * @brief     Disable peripheral Preload register on AUTORLD.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    None
 */
void TMR_DisableAutoReload(TMR_T* tmr)
{
    tmr->CTRL1_B.ARPEN = DISABLE;
}

/*!
 * @brief     Selects the Sing pulse Mode.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     singlePulseMode: specifies the Single Pulse Mode
 *            The parameter can be one of following values:
 *            @arg TMR_SPM_REPETITIVE
 *            @arg TMR_SPM_SINGLE
 *
 * @retval    None
 */
void TMR_SelectSinglePulseMode(TMR_T* tmr, TMR_SPM_T singlePulseMode)
{
    tmr->CTRL1_B.SPMEN = BIT_RESET;
    tmr->CTRL1_B.SPMEN = singlePulseMode;
}

/*!
 * @brief     Configs the Clock Division value
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     clockDivision: specifies the clock division value.
 *            The parameter can be one of following values:
 *            @arg TMR_CLOCK_DIV_1: TDTS = Tck_tim
 *            @arg TMR_CLOCK_DIV_2: TDTS = 2*Tck_tim
 *            @arg TMR_CLOCK_DIV_4: TDTS = 4*Tck_tim
 *
 * @retval    None
 */
void TMR_ConfigClockDivision(TMR_T* tmr, TMR_CLOCK_DIV_T clockDivision)
{
    tmr->CTRL1_B.CLKDIV = 0x00;
    tmr->CTRL1 |= clockDivision;
}

/*!
 * @brief     Enable the specified TMR peripheral
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    None
 */
void TMR_Enable(TMR_T* tmr)
{
    tmr->CTRL1_B.CNTEN = ENABLE;
}

/*!
 * @brief     Disable the specified TMR peripheral
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @retval    None
 */
void TMR_Disable(TMR_T* tmr)
{
    tmr->CTRL1_B.CNTEN = DISABLE;
}

/*!
 * @brief     Configure channel 1 according to parameters
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     ocConfig: Pointer to a TMR_OCConfig_T structure
 *
 * @retval    None
 */
void TMR_ConfigOC1(TMR_T* tmr, TMR_OCConfig_T* ocConfig)
{
    tmr->CCEN_B.CC1EN = BIT_RESET;

    tmr->CCM1_COMPARE_B.CC1SEL = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC1MOD = ocConfig->mode;

    tmr->CCEN_B.CC1POL = ocConfig->polarity;
    tmr->CCEN_B.CC1EN = ocConfig->outputState;

    tmr->CCEN_B.CC1NPOL = ocConfig->nPolarity;


    tmr->CC1 = ocConfig->pulse;
}

/*!
 * @brief     Configure channel 2 according to parameters
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     ocConfig: Pointer to a TMR_OCConfig_T structure
 *
 * @retval    None
 */
void TMR_ConfigOC2(TMR_T* tmr, TMR_OCConfig_T* ocConfig)
{
    tmr->CCEN_B.CC2EN = BIT_RESET;

    tmr->CCM1_COMPARE_B.OC2MOD = BIT_RESET;
    tmr->CCM1_COMPARE_B.CC2SEL = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC2MOD = ocConfig->mode;

    tmr->CCEN_B.CC2POL = BIT_RESET;
    tmr->CCEN_B.CC2POL = ocConfig->polarity;
    tmr->CCEN_B.CC2EN = ocConfig->outputState;

    tmr->CCEN_B.CC2NPOL = BIT_RESET;
    tmr->CCEN_B.CC2NPOL = ocConfig->nPolarity;

    tmr->CC2 = ocConfig->pulse;
}

/*!
 * @brief     Configure channel 3 according to parameters
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocConfig: Pointer to a TMR_OCConfig_T structure
 *
 * @retval    None
 */
void TMR_ConfigOC3(TMR_T* tmr, TMR_OCConfig_T* ocConfig)
{
    tmr->CCEN_B.CC3EN = BIT_RESET;

    tmr->CCM2_COMPARE_B.OC3MOD = BIT_RESET;
    tmr->CCM2_COMPARE_B.CC3SEL = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC3MOD = ocConfig->mode;

    tmr->CCEN_B.CC3POL = BIT_RESET;
    tmr->CCEN_B.CC3POL = ocConfig->polarity;
    tmr->CCEN_B.CC3EN = ocConfig->outputState;

    tmr->CCEN_B.CC3NPOL = BIT_RESET;
    tmr->CCEN_B.CC3NPOL = ocConfig->nPolarity;

    tmr->CC3 = ocConfig->pulse;
}

/*!
 * @brief     Configure channel 4 according to parameters
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocConfig: Pointer to a TMR_OCConfig_T structure
 *
 * @retval    None
 */
void TMR_ConfigOC4(TMR_T* tmr, TMR_OCConfig_T* ocConfig)
{
    tmr->CCEN_B.CC4EN = BIT_RESET;

    tmr->CCM2_COMPARE_B.OC4MOD = BIT_RESET;
    tmr->CCM2_COMPARE_B.CC4SEL = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC4MOD = ocConfig->mode;

    tmr->CCEN_B.CC4POL = BIT_RESET;
    tmr->CCEN_B.CC4POL = ocConfig->polarity;
    tmr->CCEN_B.CC4EN = ocConfig->outputState;

    tmr->CCEN_B.CC4NPOL = BIT_RESET;
    tmr->CCEN_B.CC4NPOL = ocConfig->nPolarity;

