frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_tmr.c
    tmr->CC4 = ocConfig->pulse;
}

/*!
 * @brief     Initialize the OC timer with its default value.
 *
 * @param     ocConfig: pointer to a TMR_OCConfig_T
 *
 * @retval    None
 */
void TMR_ConfigOCStructInit(TMR_OCConfig_T* ocConfig)
{
    ocConfig->mode = TMR_OC_MODE_TMRING;
    ocConfig->outputState = TMR_OC_STATE_DISABLE;
    ocConfig->pulse = 0x0000;
    ocConfig->polarity = TMR_OC_POLARITY_HIGH;
    ocConfig->nPolarity = TMR_OC_NPOLARITY_HIGH;
}

/*!
 * @brief     Selects the Output Compare Mode.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     channel: specifies the Channel
 *            The parameter can be one of following values:
 *            @arg TMR_CHANNEL_1: Timer Channel 1
 *            @arg TMR_CHANNEL_2: Timer Channel 2
 *            @arg TMR_CHANNEL_3: Timer Channel 3 (TMR2/3 only)
 *            @arg TMR_CHANNEL_4: Timer Channel 4 (TMR2/3 only)
 *
 * @param     mode: specifies the Output Compare Mode
 *            The parameter can be one of following values:
 *            @arg TMR_OC_MODE_TMRING
 *            @arg TMR_OC_MODE_ACTIVE
 *            @arg TMR_OC_MODE_INACTIVE
 *            @arg TMR_OC_MODE_TOGGEL
 *            @arg TMR_OC_MODE_LOWLEVEL
 *            @arg TMR_OC_MODE_HIGHLEVEL
 *            @arg TMR_OC_MODE_PWM1
 *            @arg TMR_OC_MODE_PWM2
 *
 * @retval    None
 */
void TMR_SelectOCxMode(TMR_T* tmr, TMR_CHANNEL_T channel, TMR_OC_MODE_T mode)
{
    if (channel == TMR_CHANNEL_1)
    {
        tmr->CCM1_COMPARE_B.OC1MOD = BIT_RESET;
        tmr->CCM1_COMPARE_B.OC1MOD = mode;
    }
    else if (channel == TMR_CHANNEL_2)
    {
        tmr->CCM1_COMPARE_B.OC2MOD = BIT_RESET;
        tmr->CCM1_COMPARE_B.OC2MOD = mode;
    }
    else if (channel == TMR_CHANNEL_3)
    {
        tmr->CCM2_COMPARE_B.OC3MOD = BIT_RESET;
        tmr->CCM2_COMPARE_B.OC3MOD = mode;
    }
    else if (channel == TMR_CHANNEL_4)
    {
        tmr->CCM2_COMPARE_B.OC4MOD = BIT_RESET;
        tmr->CCM2_COMPARE_B.OC4MOD = mode;
    }
}

/*!
 * @brief     Configs the Capture Compare1 Register value
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     compare1: specifies the Capture Compare1 value.
 *
 * @retval    None
 */
void TMR_ConfigCompare1(TMR_T* tmr, uint16_t compare1)
{
    tmr->CC1 = compare1;
}

/*!
 * @brief     Configs the Capture Compare2 Register value
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     compare2: specifies the Capture Compare1 value.
 *
 * @retval    None
 */
void TMR_ConfigCompare2(TMR_T* tmr, uint16_t compare2)
{
    tmr->CC2 = compare2;
}

/*!
 * @brief     Configs the Capture Compare3 Register value
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     compare3: specifies the Capture Compare1 value.
 *
 * @retval    None
 */
void TMR_ConfigCompare3(TMR_T* tmr, uint16_t compare3)
{
    tmr->CC3 = compare3;
}

/*!
 * @brief     Configs the Capture Compare4 Register value
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     compare4: specifies the Capture Compare1 value.
 *
 * @retval    None
 */
void TMR_ConfigCompare4(TMR_T* tmr, uint16_t compare4)
{
    tmr->CC4 = compare4;
}

/*!
 * @brief     Forces the output 1 waveform to active or inactive level.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     forcesAction: specifies the forced Action to be set to the output waveform
 *            The parameter can be one of following values:
 *            @arg TMR_FORCED_ACTION_ACTIVE:  Force active level on OC1REF
 *            @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC1(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM1_COMPARE_B.OC1MOD = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC1MOD = forcesAction;
}

/*!
 * @brief     Forces the output 2 waveform to active or inactive level.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     forcesAction: specifies the forced Action to be set to the output waveform
 *            The parameter can be one of following values:
 *            @arg TMR_FORCED_ACTION_ACTIVE:  Force active level on OC1REF
 *            @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC2(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM1_COMPARE_B.OC2MOD = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC2MOD = forcesAction;
}

/*!
 * @brief     Forces the output 3 waveform to active or inactive level.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     forcesAction: specifies the forced Action to be set to the output waveform
 *            The parameter can be one of following values:
 *            @arg TMR_FORCED_ACTION_ACTIVE:  Force active level on OC1REF
 *            @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC3(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM2_COMPARE_B.OC3MOD = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC3MOD = forcesAction;
}

/*!
 * @brief     Forces the output 4 waveform to active or inactive level.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     forcesAction: specifies the forced Action to be set to the output waveform
 *            The parameter can be one of following values:
 *            @arg TMR_FORCED_ACTION_ACTIVE:  Force active level on OC1REF
 *            @arg TMR_FORCED_ACTION_INACTIVE: Force inactive level on OC1REF
 *
 * @retval    None
 */
void TMR_ConfigForcedOC4(TMR_T* tmr, TMR_FORCED_ACTION_T forcesAction)
{
    tmr->CCM2_COMPARE_B.OC4MOD = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC4MOD = forcesAction;
}


/*!
 * @brief     Enables or disables the peripheral Preload register on CCM1.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     ocPreload: specifies the Output Compare Channel Preload
 *            The parameter can be one of following values:
 *            @arg TMR_OC_PRELOAD_DISABLE
 *            @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC1Preload(TMR_T* tmr, TMR_OC_PRELOAD_T ocPreload)
{
    tmr->CCM1_COMPARE_B.OC1PEN = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC1PEN = ocPreload;
}

/*!
 * @brief     Enables or disables the peripheral Preload register on CCM2.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     ocPreload: specifies the Output Compare Channel Preload
 *            The parameter can be one of following values:
 *            @arg TMR_OC_PRELOAD_DISABLE
 *            @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC2Preload(TMR_T* tmr, TMR_OC_PRELOAD_T ocPreload)
{
    tmr->CCM1_COMPARE_B.OC2PEN = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC2PEN = ocPreload;
}

/*!
 * @brief     Enables or disables the peripheral Preload register on CCM3.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocPreload: specifies the Output Compare Channel Preload
 *            The parameter can be one of following values:
 *            @arg TMR_OC_PRELOAD_DISABLE
 *            @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC3Preload(TMR_T* tmr, TMR_OC_PRELOAD_T ocPreload)
{
    tmr->CCM2_COMPARE_B.OC3PEN = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC3PEN = ocPreload;
}

/*!
 * @brief     Enables or disables the peripheral Preload register on CCM4.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocPreload: specifies the Output Compare Channel Preload
 *            The parameter can be one of following values:
 *            @arg TMR_OC_PRELOAD_DISABLE
 *            @arg TMR_OC_PRELOAD_ENABLE
 *
 * @retval    Nonee
 */
void TMR_ConfigOC4Preload(TMR_T* tmr, TMR_OC_PRELOAD_T ocPreload)
{
    tmr->CCM2_COMPARE_B.OC4PEN = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC4PEN = ocPreload;
}

/*!
 * @brief     Configures the Output Compare 1 Fast feature.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     ocFast: specifies the Output Compare Channel Fast
 *            The parameter can be one of following values:
 *            @arg TMR_OC_FAST_DISABLE
 *            @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC1Fast(TMR_T* tmr, TMR_OC_FAST_T ocFast)
{
    tmr->CCM1_COMPARE_B.OC1FEN = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC1FEN = ocFast;
}

/*!
 * @brief     Configures the Output Compare 2 Fast feature.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     ocFast: specifies the Output Compare Channel Fast
 *            The parameter can be one of following values:
 *            @arg TMR_OC_FAST_DISABLE
 *            @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC2Fast(TMR_T* tmr, TMR_OC_FAST_T ocFast)
{
    tmr->CCM1_COMPARE_B.OC2FEN = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC2FEN = ocFast;
}

/*!
 * @brief     Configures the Output Compare 2 Fast feature.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocFast: specifies the Output Compare Channel Fast
 *            The parameter can be one of following values:
 *            @arg TMR_OC_FAST_DISABLE
 *            @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC3Fast(TMR_T* tmr, TMR_OC_FAST_T ocFast)
{
    tmr->CCM2_COMPARE_B.OC3FEN = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC3FEN = ocFast;
}

/*!
 * @brief     Configures the Output Compare 4 Fast feature.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocFast: specifies the Output Compare Channel Fast
 *            The parameter can be one of following values:
 *            @arg TMR_OC_FAST_DISABLE
 *            @arg TMR_OC_FAST_ENABLE
 *
 * @retval    None
 */
void TMR_ConfigOC4Fast(TMR_T* tmr, TMR_OC_FAST_T ocFast)
{
    tmr->CCM2_COMPARE_B.OC4FEN = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC4FEN = ocFast;
}

/*!
 * @brief     Clears or safeguards the OCREF1 signal on an external event
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocClear: specifies the Output Compare Channel1 Clear
 *            The parameter can be one of following values:
 *            @arg TMR_OC_CLEAR_DISABLE
 *            @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC1Ref(TMR_T* tmr, TMR_OC_CLEAR_T ocClear)
{
    tmr->CCM1_COMPARE_B.OC1CEN = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC1CEN = ocClear;
}

/*!
 * @brief     Clears or safeguards the OCREF2 signal on an external event
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocClear: specifies the Output Compare Channel1 Clear
 *            The parameter can be one of following values:
 *            @arg TMR_OC_CLEAR_DISABLE
 *            @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC2Ref(TMR_T* tmr, TMR_OC_CLEAR_T ocClear)
{
    tmr->CCM1_COMPARE_B.OC2CEN = BIT_RESET;
    tmr->CCM1_COMPARE_B.OC2CEN = ocClear;
}

/*!
 * @brief     Clears or safeguards the OCREF3 signal on an external event
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocClear: specifies the Output Compare Channel1 Clear
 *            The parameter can be one of following values:
 *            @arg TMR_OC_CLEAR_DISABLE
 *            @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC3Ref(TMR_T* tmr, TMR_OC_CLEAR_T ocClear)
{
    tmr->CCM2_COMPARE_B.OC3CEN = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC3CEN = ocClear;
}

/*!
 * @brief     Clears or safeguards the OCREF4 signal on an external event
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     ocClear: specifies the Output Compare Channel1 Clear
 *            The parameter can be one of following values:
 *            @arg TMR_OC_CLEAR_DISABLE
 *            @arg TMR_OC_CLEAR_ENABLE
 *
 * @retval    None
 */
void TMR_ClearOC4Ref(TMR_T* tmr, TMR_OC_CLEAR_T ocClear)
{
    tmr->CCM2_COMPARE_B.OC4CEN = BIT_RESET;
    tmr->CCM2_COMPARE_B.OC4CEN = ocClear;
}

/*!
 * @brief     Configures the channel 1 polarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     polarity: specifies the OC1 Polarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_POLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC1Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC1POL = BIT_RESET;
    tmr->CCEN_B.CC1POL = polarity;
}

/*!
 * @brief     Configures the channel 1 nPolarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     nPolarity: specifies the OC1 nPolarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_NPOLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_NPOLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC1NPolarity(TMR_T* tmr, TMR_OC_NPOLARITY_T nPolarity)
{
    tmr->CCEN_B.CC1NPOL = BIT_RESET;
    tmr->CCEN_B.CC1NPOL = nPolarity;
}

/*!
 * @brief     Configures the channel 2 polarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     polarity: specifies the OC2 Polarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_POLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC2Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC2POL = BIT_RESET;
    tmr->CCEN_B.CC2POL = polarity;
}

/*!
 * @brief     Configures the channel 2 nPolarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     nPolarity: specifies the OC2 nPolarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_NPOLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_NPOLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC2NPolarity(TMR_T* tmr, TMR_OC_NPOLARITY_T nPolarity)
{
    tmr->CCEN_B.CC2NPOL = BIT_RESET;
    tmr->CCEN_B.CC2NPOL = nPolarity;
}

/*!
 * @brief     Configures the channel 3 polarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     polarity: specifies the OC3 Polarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_POLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC3Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC3POL = BIT_RESET;
    tmr->CCEN_B.CC3POL = polarity;
}

/*!
 * @brief     Configures the channel 3 nPolarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     nPolarity: specifies the OC3 nPolarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_NPOLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_NPOLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC3NPolarity(TMR_T* tmr, TMR_OC_NPOLARITY_T nPolarity)
{
    tmr->CCEN_B.CC3NPOL = BIT_RESET;
    tmr->CCEN_B.CC3NPOL = nPolarity;
}

/*!
 * @brief     Configures the channel 4 polarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     polarity: specifies the OC4 Polarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_POLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_POLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC4Polarity(TMR_T* tmr, TMR_OC_POLARITY_T polarity)
{
    tmr->CCEN_B.CC4POL = BIT_RESET;
    tmr->CCEN_B.CC4POL = polarity;
}

/*!
 * @brief     Configures the channel 4 nPolarity.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     nPolarity: specifies the OC3 nPolarity
 *            The parameter can be one of following values:
 *            @arg TMR_OC_NPOLARITY_HIGH: Output Compare active high
 *            @arg TMR_OC_NPOLARITY_LOW: Output Compare active low
 *
 * @retval    None
 */
void TMR_ConfigOC4NPolarity(TMR_T* tmr, TMR_OC_NPOLARITY_T nPolarity)
{
    tmr->CCEN_B.CC4NPOL = BIT_RESET;
    tmr->CCEN_B.CC4NPOL = nPolarity;
}

/*!
 * @brief     Enables the Capture Compare Channel x.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     channel: specifies the Channel
 *            The parameter can be one of following values:
 *            @arg TMR_CHANNEL_1: Timer Channel 1
 *            @arg TMR_CHANNEL_2: Timer Channel 2
 *            @arg TMR_CHANNEL_3: Timer Channel 3 (TMR2/3 only)
 *            @arg TMR_CHANNEL_4: Timer Channel 4 (TMR2/3 only)
 *
 * @retval    None
 */
void TMR_EnableCCxChannel(TMR_T* tmr, TMR_CHANNEL_T channel)
{
    if (channel == TMR_CHANNEL_1)
    {
        tmr->CCEN_B.CC1EN = BIT_RESET;
        tmr->CCEN_B.CC1EN = BIT_SET;
    }
    else if (channel == TMR_CHANNEL_2)
    {
        tmr->CCEN_B.CC2EN = BIT_RESET;
        tmr->CCEN_B.CC2EN = BIT_SET;
    }
    else if (channel == TMR_CHANNEL_3)
    {
        tmr->CCEN_B.CC3EN = BIT_RESET;
        tmr->CCEN_B.CC3EN = BIT_SET;
    }
    else if (channel == TMR_CHANNEL_4)
    {
        tmr->CCEN_B.CC4EN = BIT_RESET;
        tmr->CCEN_B.CC4EN = BIT_SET;
    }
}

/*!
 * @brief     Disables the Capture Compare Channel x.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     channel: specifies the Channel
 *            The parameter can be one of following values:
 *            @arg TMR_CHANNEL_1: Timer Channel 1
 *            @arg TMR_CHANNEL_2: Timer Channel 2
 *            @arg TMR_CHANNEL_3: Timer Channel 3 (TMR2/3 only)
 *            @arg TMR_CHANNEL_4: Timer Channel 4 (TMR2/3 only)
 *
 * @retval    None
 */
void TMR_DisableCCxChannel(TMR_T* tmr, TMR_CHANNEL_T channel)
{
    if (channel == TMR_CHANNEL_1)
    {
        tmr->CCEN_B.CC1EN = BIT_RESET;
    }
    else if (channel == TMR_CHANNEL_2)
    {
        tmr->CCEN_B.CC2EN = BIT_RESET;
    }
    else if (channel == TMR_CHANNEL_3)
    {
        tmr->CCEN_B.CC3EN = BIT_RESET;
    }
    else if (channel == TMR_CHANNEL_4)
    {
        tmr->CCEN_B.CC4EN = BIT_RESET;
    }
}

/*!
 * @brief     Configure Peripheral equipment
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     icConfig: Pointer to a TMR_ICConfig_T structure
 *
 * @note      TMR_CHANNEL_3 TMR_CHANNEL_4 is used only in TMR2/3
 *
 * @retval    None
 */
void TMR_ConfigIC(TMR_T* tmr, TMR_ICConfig_T* icConfig)
{
    if (icConfig->channel == TMR_CHANNEL_1)
    {
        TI1Config(tmr, icConfig->polarity, icConfig->selection, icConfig->filter);
        TMR_ConfigIC1Prescaler(tmr, icConfig->prescaler);
    }
    else if (icConfig->channel == TMR_CHANNEL_2)
    {
        TI2Config(tmr, icConfig->polarity, icConfig->selection, icConfig->filter);
        TMR_ConfigIC2Prescaler(tmr, icConfig->prescaler);
    }
    else if (icConfig->channel == TMR_CHANNEL_3)
    {
        TI3Config(tmr, icConfig->polarity, icConfig->selection, icConfig->filter);
        TMR_ConfigIC3Prescaler(tmr, icConfig->prescaler);
    }
    else if (icConfig->channel == TMR_CHANNEL_4)
    {
        TI4Config(tmr, icConfig->polarity, icConfig->selection, icConfig->filter);
        TMR_ConfigIC4Prescaler(tmr, icConfig->prescaler);
    }
}

/*!
 * @brief     Initialize the IC timer with its default value.
 *
 * @param     icConfig: pointer to a TMR_ICConfig_T
 *
 * @retval    None
 */
void TMR_ConfigICStructInit(TMR_ICConfig_T* icConfig)
{
    icConfig->channel = TMR_CHANNEL_1;
    icConfig->polarity = TMR_IC_POLARITY_RISING;
    icConfig->selection = TMR_IC_SELECTION_DIRECT_TI;
    icConfig->prescaler = TMR_IC_PSC_1;
    icConfig->filter = 0x00;
}

/*!
 * @brief     Config of TMR to PWM
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     pwmConfig: pointer to a TMR_ICConfig_T
 *
 * @note      TMR_CHANNEL_3 TMR_CHANNEL_4 is used only in TMR2/3
 *
 * @retval    None
 */
void TMR_ConfigPWM(TMR_T* tmr, TMR_ICConfig_T* pwmConfig)
{
    uint16_t icpolarity = TMR_IC_POLARITY_RISING;
    uint16_t icselection = TMR_IC_SELECTION_DIRECT_TI;

    if (pwmConfig->polarity == TMR_IC_POLARITY_RISING)
    {
        icpolarity = TMR_IC_POLARITY_FALLING;
    }
    else
    {
        icpolarity = TMR_IC_POLARITY_RISING;
    }

    if (pwmConfig->selection == TMR_IC_SELECTION_DIRECT_TI)
    {
        icselection = TMR_IC_SELECTION_INDIRECT_TI;
    }
    else
    {
        icselection = TMR_IC_SELECTION_DIRECT_TI;
    }

    if (pwmConfig->channel == TMR_CHANNEL_1)
    {
        TI1Config(tmr, pwmConfig->polarity, pwmConfig->selection, pwmConfig->filter);
        TMR_ConfigIC1Prescaler(tmr, pwmConfig->prescaler);
        TI2Config(tmr, icpolarity, icselection, pwmConfig->filter);
        TMR_ConfigIC2Prescaler(tmr, pwmConfig->prescaler);
    }
    else
    {
        TI2Config(tmr, pwmConfig->polarity, pwmConfig->selection, pwmConfig->filter);
        TMR_ConfigIC2Prescaler(tmr, pwmConfig->prescaler);
        TI1Config(tmr, icpolarity, icselection, pwmConfig->filter);
        TMR_ConfigIC1Prescaler(tmr, pwmConfig->prescaler);
    }
}

/*!
 * @brief     Read Input Capture 1 value.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @retval    Capture Compare 1 Register value.
 */
uint16_t TMR_ReadCaputer1(TMR_T* tmr)
{
    return tmr->CC1;
}

/*!
 * @brief     Read Input Capture 2 value.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @retval    Capture Compare 2 Register value.
 */
uint16_t TMR_ReadCaputer2(TMR_T* tmr)
{
    return tmr->CC2;
}

/*!
 * @brief     Read Input Capture 3 value.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @retval    Capture Compare 3 Register value.
 */
uint16_t TMR_ReadCaputer3(TMR_T* tmr)
{
    return tmr->CC3;
}

/*!
 * @brief     Read Input Capture 4 value.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @retval    Capture Compare 4 Register value.
 */
uint16_t TMR_ReadCaputer4(TMR_T* tmr)
{
    return tmr->CC4;
}

