frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_tmr.c
/*!
 * @brief     Configs the TMRx Input Capture 1 prescaler.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     prescaler: specifies the Input Capture Channel1 Perscaler
 *            The parameter can be one of following values:
 *            @arg TMR_IC_PSC_1: no prescaler
 *            @arg TMR_IC_PSC_2: capture is done once every 2 events
 *            @arg TMR_IC_PSC_4: capture is done once every 4 events
 *            @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC1Prescaler(TMR_T* tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM1_CAPTURE_B.IC1PSC = BIT_RESET;
    tmr->CCM1_CAPTURE_B.IC1PSC = prescaler;
}
/*!
 * @brief     Sets the TMRx Input Capture 2 prescaler.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     prescaler: specifies the Input Capture Channel2 Perscaler
 *            The parameter can be one of following values:
 *            @arg TMR_IC_PSC_1: no prescaler
 *            @arg TMR_IC_PSC_2: capture is done once every 2 events
 *            @arg TMR_IC_PSC_4: capture is done once every 4 events
 *            @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC2Prescaler(TMR_T* tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM1_CAPTURE_B.IC2PSC = BIT_RESET;
    tmr->CCM1_CAPTURE_B.IC2PSC = prescaler;
}

/*!
 * @brief     Configs the TMRx Input Capture 3 prescaler.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     prescaler: specifies the Input Capture Channel3 Perscaler
 *            The parameter can be one of following values:
 *            @arg TMR_IC_PSC_1: no prescaler
 *            @arg TMR_IC_PSC_2: capture is done once every 2 events
 *            @arg TMR_IC_PSC_4: capture is done once every 4 events
 *            @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC3Prescaler(TMR_T* tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM2_CAPTURE_B.IC3PSC = BIT_RESET;
    tmr->CCM2_CAPTURE_B.IC3PSC = prescaler;
}

/*!
 * @brief     Configs the TMRx Input Capture 4 prescaler.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     prescaler: specifies the Input Capture Channel4 Perscaler
 *            The parameter can be one of following values:
 *            @arg TMR_IC_PSC_1: no prescaler
 *            @arg TMR_IC_PSC_2: capture is done once every 2 events
 *            @arg TMR_IC_PSC_4: capture is done once every 4 events
 *            @arg TMR_IC_PSC_8: capture is done once every 8 events
 *
 * @retval    None
 */
void TMR_ConfigIC4Prescaler(TMR_T* tmr, TMR_IC_PSC_T prescaler)
{
    tmr->CCM2_CAPTURE_B.IC4PSC = BIT_RESET;
    tmr->CCM2_CAPTURE_B.IC4PSC = prescaler;
}

/*!
 * @brief     Enable interrupts
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *            The parameter can be any combination of following values:
 *            @arg TMR_INT_UPDATE: Timer update Interrupt source
 *            @arg TMR_INT_CH1: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH2: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH3: Timer Capture Compare 3 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_CH4: Timer Capture Compare 4 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_TRG: Timer Trigger Interrupt source           (TMR 2/3 only)
 *
 * @retval    None
 */
void TMR_EnableInterrupt(TMR_T* tmr, uint16_t interrupt)
{
    tmr->DIEN |= interrupt;
}

/*!
 * @brief     Disable intterupts
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *            The parameter can be any combination of following values:
 *            @arg TMR_INT_UPDATE: Timer update Interrupt source
 *            @arg TMR_INT_CH1: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH2: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH3: Timer Capture Compare 3 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_CH4: Timer Capture Compare 4 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_TRG: Timer Trigger Interrupt source           (TMR 2/3 only)
 *
 * @retval    None
 */
void TMR_DisableInterrupt(TMR_T* tmr, uint16_t interrupt)
{
    tmr->DIEN &= ~interrupt;
}

/*!
 * @brief     Configures the TMRx event to be generate by software.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     eventSources: specifies the TMR event sources
 *            The parameter can be any combination of following values:
 *            @arg TMR_EVENT_UPDATE: Timer update Interrupt source
 *            @arg TMR_EVENT_CH1: Timer Capture Compare 1 Event source (TMR 2/3/21/22 only)
 *            @arg TMR_EVENT_CH2: Timer Capture Compare 1 Event source (TMR 2/3/21/22 only)
 *            @arg TMR_EVENT_CH3: Timer Capture Compare 3 Event source (TMR 2/3 only)
 *            @arg TMR_EVENT_CH4: Timer Capture Compare 4 Event source (TMR 2/3 only)
 *            @arg TMR_EVENT_TRG: Timer Trigger Event source           (TMR 2/3 only)
 *
 * @retval    None
 */
void TMR_GenerateEvent(TMR_T* tmr, uint16_t eventSources)
{
    tmr->CEG = eventSources;
}

/*!
 * @brief     Check whether the flag is set or reset
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *            The parameter can be any combination of following values:
 *            @arg TMR_FLAG_UPDATE: Timer update Flag
 *            @arg TMR_FLAG_CH1: Timer Capture Compare 1 Flag              (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CH2: Timer Capture Compare 2 Flag              (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CH3: Timer Capture Compare 3 Flag              (TMR 2/3 only)
 *            @arg TMR_FLAG_CH4: Timer Capture Compare 4 Flag              (TMR 2/3 only)
 *            @arg TMR_FLAG_TRG: Timer Trigger Flag                        (TMR 2/3 only)
 *            @arg TMR_FLAG_CC1RC: Timer Capture Compare 1 Repetition Flag (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CC2RC: Timer Capture Compare 2 Repetition Flag (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CC3RC: Timer Capture Compare 3 Repetition Flag (TMR 2/3 only)
 *            @arg TMR_FLAG_CC4RC: Timer Capture Compare 4 Repetition Flag (TMR 2/3 only)
 *
 * @retval    None
 */
uint16_t TMR_ReadStatusFlag(TMR_T* tmr, TMR_FLAG_T flag)
{
    if ((tmr->STS & flag) != RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/*!
 * @brief     Clears the TMR's pending flags.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *            The parameter can be any combination of following values:
 *            @arg TMR_FLAG_UPDATE: Timer update Flag
 *            @arg TMR_FLAG_CH1: Timer Capture Compare 1 Flag              (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CH2: Timer Capture Compare 2 Flag              (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CH3: Timer Capture Compare 3 Flag              (TMR 2/3 only)
 *            @arg TMR_FLAG_CH4: Timer Capture Compare 4 Flag              (TMR 2/3 only)
 *            @arg TMR_FLAG_TRG: Timer Trigger Flag                        (TMR 2/3 only)
 *            @arg TMR_FLAG_CC1RC: Timer Capture Compare 1 Repetition Flag (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CC2RC: Timer Capture Compare 2 Repetition Flag (TMR 2/3/21/22 only)
 *            @arg TMR_FLAG_CC3RC: Timer Capture Compare 3 Repetition Flag (TMR 2/3 only)
 *            @arg TMR_FLAG_CC4RC: Timer Capture Compare 4 Repetition Flag (TMR 2/3 only)
 *
 * @retval    None
 */
void TMR_ClearStatusFlag(TMR_T* tmr, uint16_t flag)
{
    tmr->STS = ~flag;
}

/*!
 * @brief     Check whether the ITflag is set or reset
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *            The parameter can be one of following values:
 *            @arg TMR_INT_UPDATE: Timer update Interrupt source
 *            @arg TMR_INT_CH1: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH2: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH3: Timer Capture Compare 3 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_CH4: Timer Capture Compare 4 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_TRG: Timer Trigger Interrupt source           (TMR 2/3 only)
 *
 * @retval    None
 */
uint16_t TMR_ReadIntFlag(TMR_T* tmr, TMR_INT_T flag)
{
    if (((tmr->STS & flag) != RESET ) && ((tmr->DIEN & flag) != RESET))
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/*!
 * @brief     Clears the TMR's interrupt pending bits.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     interrupt: specifies the TMR interrupts sources
 *            The parameter can be any combination following values:
 *            @arg TMR_INT_UPDATE: Timer update Interrupt source
 *            @arg TMR_INT_CH1: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH2: Timer Capture Compare 1 Interrupt source (TMR 2/3/21/22 only)
 *            @arg TMR_INT_CH3: Timer Capture Compare 3 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_CH4: Timer Capture Compare 4 Interrupt source (TMR 2/3 only)
 *            @arg TMR_INT_TRG: Timer Trigger Interrupt source           (TMR 2/3 only)
 *
 * @retval    None
 */
void TMR_ClearIntFlag(TMR_T* tmr,  uint16_t flag)
{
    tmr->STS = ~flag;
}

/*!
 * @brief     Configures the TMRx's DMA interface.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     address: DMA Base address.
 *            This parameter can be one of the following values:
 *            @arg TMR_DMA_BASE_CTRL1
 *            @arg TMR_DMA_BASE_CTRL2
 *            @arg TMR_DMA_BASE_SMCTRL
 *            @arg TMR_DMA_BASE_DIEN
 *            @arg TMR_DMA_BASE_STS
 *            @arg TMR_DMA_BASE_CEG
 *            @arg TMR_DMA_BASE_CCM1
 *            @arg TMR_DMA_BASE_CCM2
 *            @arg TMR_DMA_BASE_CCEN
 *            @arg TMR_DMA_BASE_CNT
 *            @arg TMR_DMA_BASE_PSC
 *            @arg TMR_DMA_BASE_AUTORLD
 *            @arg TMR_DMA_BASE_CC1
 *            @arg TMR_DMA_BASE_CC2
 *            @arg TMR_DMA_BASE_CC3
 *            @arg TMR_DMA_BASE_CC4
 *            @arg TMR_DMA_BASE_OPT
 *
 * @param     lenght: DMA Burst length. This parameter can be one value
 *            between: TMR_DMA_BURSTLENGTH_1TRANSFER and TMR_DMA_BURSTLENGTH_18TRANSFERS.
 *
 * @retval    None
 */
void TMR_ConfigDMA(TMR_T* tmr, TMR_DMA_BASE_T address, TMR_DMA_BURSTLENGTH_T lenght)
{
    tmr->DCTRL = (uint32_t)address | (uint32_t)lenght;
}

/*!
 * @brief     Enable TMRx Requests.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7
 *
 * @param     souces: specifies the TMR DMA souces
 *            The parameter can be any combination of following values:
 *            @arg TMR_DMA_SOURCE_UPDATE: TMR update DMA souces
 *            @arg TMR_DMA_SOURCE_CH1:    TMR Capture Compare 1 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_CH2:    TMR Capture Compare 2 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_CH3:    TMR Capture Compare 3 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_CH4:    TMR Capture Compare 4 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_TRG:    TMR Trigger DMA souces           (TMR 2/3 only)
 *
 * @retval    None
 *
 * @note
 */
void TMR_EnableDMASoure(TMR_T* tmr, uint16_t dmaSource)
{
    tmr->DIEN |= dmaSource;
}

/*!
 * @brief     Disable TMRx Requests.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7
 *
 * @param     souces: specifies the TMR DMA souces
 *            The parameter can be any combination of following values:
 *            @arg TMR_DMA_SOURCE_UPDATE: TMR update DMA souces
 *            @arg TMR_DMA_SOURCE_CH1:    TMR Capture Compare 1 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_CH2:    TMR Capture Compare 2 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_CH3:    TMR Capture Compare 3 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_CH4:    TMR Capture Compare 4 DMA souces (TMR 2/3 only)
 *            @arg TMR_DMA_SOURCE_TRG:    TMR Trigger DMA souces           (TMR 2/3 only)
 *
 * @retval    None
 *
 * @note
 */
void TMR_DisableDMASoure(TMR_T* tmr, uint16_t dmaSource)
{
    tmr->DIEN &= ~dmaSource;
}

/*!
 * @brief     Enable Capture Compare DMA source.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @retval    None
 */
void TMR_EnableCCDMA(TMR_T* tmr)
{
    tmr->CTRL2_B.CCDSEL = ENABLE;
}

/*!
 * @brief     Disable Capture Compare DMA source.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @retval    None
 */
void TMR_DisableCCDMA(TMR_T* tmr)
{
    tmr->CTRL2_B.CCDSEL = DISABLE;
}

/*!
 * @brief     Configures the TMRx internal Clock
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @retval    None
 */
void TMR_ConfigInternalClock(TMR_T* tmr)
{
    tmr->SMCTRL_B.SMFSEL = BIT_RESET;
}

/*!
 * @brief     Configures the TMRx Internal Trigger as External Clock
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     triggerSource: specifies the TMR trigger souces
 *            The parameter can be one of following values:
 *            @arg TMR_TRIGGER_SOURCE_ITR0: TMR Internal Trigger 0
 *            @arg TMR_TRIGGER_SOURCE_ITR1: TMR Internal Trigger 1
 *            @arg TMR_TRIGGER_SOURCE_ITR2: TMR Internal Trigger 2 (TMR2/3 only)
 *
 * @retval    None
 */
void TMR_ConfigITRxExternalClock(TMR_T* tmr, TMR_TRIGGER_SOURCE_T triggerSource)
{
    TMR_SelectInputTrigger(tmr, triggerSource);
    tmr->SMCTRL_B.SMFSEL = 0x07;
}

/*!
 * @brief     Configures the TMRx  Trigger as External Clock
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     triggerSource: specifies the TMR trigger souces
 *            The parameter can be one of following values:
 *            @arg TMR_TRIGGER_SOURCE_TI1F_ED:  TI1 Edge Detector
 *            @arg TMR_TRIGGER_SOURCE_TI1FP1:   Filtered Timer Input 1
 *            @arg TMR_TRIGGER_SOURCE_TI2FP2:   Filtered Timer Input 2
 *
 * @param     icPolarity: specifies the TMR IC polarity
 *            The parameter can be one of following values:
 *            @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *            @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @param     icFilter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigTIxExternalClock(TMR_T* tmr, TMR_TRIGGER_SOURCE_T triggerSource,
                                TMR_IC_POLARITY_T icPolarity, uint16_t icFilter)
{
    if (triggerSource == TMR_TRIGGER_SOURCE_TI2FP2)
    {
        TI2Config(tmr, icPolarity, TMR_IC_SELECTION_DIRECT_TI, icFilter);
    }
    else
    {
        TI1Config(tmr, icPolarity, TMR_IC_SELECTION_DIRECT_TI, icFilter);
    }

