frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_tmr.c
    TMR_SelectInputTrigger(tmr, triggerSource);
    tmr->SMCTRL_B.SMFSEL = 0x07;
}

/*!
 * @brief     Configures the External clock Mode1
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     prescaler: specifies the external Trigger Prescaler
 *            The parameter can be one of following values:
 *            @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *            @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *            @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *            @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specifies the TMR IC polarity
 *            The parameter can be one of following values:
 *            @arg TMR_EXTTRG_POL_INVERTED:  Active low or falling edge active
 *            @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETRClockMode1(TMR_T* tmr, TMR_EXTTRG_PSC_T prescaler,
                             TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    uint16_t temp1 = 0;
    TMR_ConfigETR(tmr, prescaler, polarity, filter);

    temp1 = tmr->SMCTRL;

    temp1 &= 0xFFF8;
    temp1 |= 0x0007;

    temp1 &= 0xFF8F;
    temp1 |= 0x0070;

    tmr->SMCTRL = temp1;
}

/*!
 * @brief     Configures the External clock Mode2
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     prescaler: specifies the external Trigger Prescaler
 *            The parameter can be one of following values:
 *            @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *            @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *            @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *            @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specifies the TMR IC polarity
 *            The parameter can be one of following values:
 *            @arg TMR_EXTTRG_POL_INVERTED:  Active low or falling edge active
 *            @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETRClockMode2(TMR_T* tmr, TMR_EXTTRG_PSC_T prescaler,
                             TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    TMR_ConfigETR(tmr, prescaler, polarity, filter);
    tmr->SMCTRL_B.ECEN = ENABLE;
}

/*!
 * @brief     Selects the Input Trigger source
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     triggerSource: specifies the Input Trigger source
 *            The parameter can be one of following values:
 *            @arg TMR_TRIGGER_SOURCE_ITR0: Internal Trigger 0
 *            @arg TMR_TRIGGER_SOURCE_ITR1: Internal Trigger 1
 *            @arg TMR_TRIGGER_SOURCE_ITR2: Internal Trigger 2 (TMR2/3 only)
 *            @arg TMR_TRIGGER_SOURCE_TI1F_ED: TI1 Edge Detector
 *            @arg TMR_TRIGGER_SOURCE_TI1FP1: Filtered Timer Input 1
 *            @arg TMR_TRIGGER_SOURCE_TI2FP2: Filtered Timer Input 2
 *            @arg TMR_TRIGGER_SOURCE_ETRF: External Trigger input (TMR2/3 only)
 *
 * @retval    None
 */
void TMR_SelectInputTrigger(TMR_T* tmr, TMR_TRIGGER_SOURCE_T triggerSource)
{
    tmr->SMCTRL_B.TRGSEL = BIT_RESET;
    tmr->SMCTRL_B.TRGSEL = triggerSource;
}

/*!
 * @brief     Selects the Trigger Output Mode.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 6 7 21 22
 *
 * @param     trgoSource: specifies the Trigger Output source
 *            The parameter can be one of following values:
 *            @arg TMR_TRGO_SOURCE_RESET
 *            @arg TMR_TRGO_SOURCE_ENABLE
 *            @arg TMR_TRGO_SOURCE_UPDATE
 *            @arg TMR_TRGO_SOURCE_OC1    (TMR2/3/21/22 only)
 *            @arg TMR_TRGO_SOURCE_OC1REF (TMR2/3/21/22 only)
 *            @arg TMR_TRGO_SOURCE_OC2REF (TMR2/3/21/22 only)
 *            @arg TMR_TRGO_SOURCE_OC3REF (TMR2/3 only)
 *            @arg TMR_TRGO_SOURCE_OC4REF (TMR2/3 only)
 *
 * @retval    None
 */
void TMR_SelectOutputTrigger(TMR_T* tmr, TMR_TRGO_SOURCE_T trgoSource)
{
    tmr->CTRL2_B.MMSEL = BIT_RESET;
    tmr->CTRL2_B.MMSEL = trgoSource;
}

/*!
 * @brief     Selects the Slave Mode.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     slaveMode: specifies the Timer Slave Mode.
 *            The parameter can be one of following values:
 *            @arg TMR_SLAVE_MODE_DISABLE
 *            @arg TMR_SLAVE_MODE_ECODER1
 *            @arg TMR_SLAVE_MODE_ECODER2
 *            @arg TMR_SLAVE_MODE_ECODER3
 *            @arg TMR_SLAVE_MODE_RESET
 *            @arg TMR_SLAVE_MODE_GATED
 *            @arg TMR_SLAVE_MODE_TRIGGER
 *            @arg TMR_SLAVE_MODE_EXTERNAL1
 *
 * @retval    None
 */
void TMR_SelectSlaveMode(TMR_T* tmr, TMR_SLAVE_MODE_T slaveMode)
{
    tmr->SMCTRL_B.SMFSEL = slaveMode;
}

/*!
 * @brief     Enable the Master Slave Mode
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @retval    None
 */
void TMR_EnableMasterSlaveMode(TMR_T* tmr)
{
    tmr->SMCTRL_B.MSMEN = ENABLE;
}

/*!
 * @brief     Disable the Master Slave Mode
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @retval    None
 */
void TMR_DisableMasterSlaveMode(TMR_T* tmr)
{
    tmr->SMCTRL_B.MSMEN = DISABLE;
}

/*!
 * @brief     Configures the TMRx External Trigger (ETR).
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     prescaler: specifies the external Trigger Prescaler
 *            The parameter can be one of following values:
 *            @arg TMR_EXTTRG_PSC_OFF:  ETRP Prescaler OFF
 *            @arg TMR_EXTTRG_PSC_DIV2: ETRP frequency divided by 2
 *            @arg TMR_EXTTRG_PSC_DIV4: ETRP frequency divided by 4
 *            @arg TMR_EXTTRG_PSC_DIV8: ETRP frequency divided by 8
 *
 * @param     polarity: specifies the TMR IC polarity
 *            The parameter can be one of following values:
 *            @arg TMR_EXTTRG_POL_INVERTED:  Active low or falling edge active
 *            @arg TMR_EXTTGR_POL_NONINVERTED: Active high or rising edge active
 *
 * @param     filter: This parameter must be a value between 0x00 and 0x0F.
 *
 * @retval    None
 */
void TMR_ConfigETR(TMR_T* tmr, TMR_EXTTRG_PSC_T prescaler,
                   TMR_EXTTRG_POL_T polarity, uint16_t filter)
{
    tmr->SMCTRL &= 0x00FF;
    tmr->SMCTRL_B.ETPCFG = prescaler;
    tmr->SMCTRL_B.ETPOL = polarity;
    tmr->SMCTRL_B.ETFCFG = filter;
}

/*!
 * @brief     Configures the Encoder Interface.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     encodeMode: specifies the Encoder Mode
 *            The parameter can be one of following values:
 *            @arg TMR_ENCODER_MODE_TI1   : Counter counts on TI1FP1 edge depending on TI2FP2 level.
 *            @arg TMR_ENCODER_MODE_TI2   : Counter counts on TI2FP2 edge depending on TI1FP1 level.
 *            @arg TMR_ENCODER_MODE_TI12  : Counter counts on both TI1FP1 and TI2FP2 edges depending
 *                                          on the level of the other input.
 * @param     ic1Polarity: specifies the TMR IC1 polarity
 *            The parameter can be one of following values:
 *            @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *            @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @param     ic2Polarity: specifies the TMR IC2 polarity
 *            The parameter can be one of following values:
 *            @arg TMR_IC_POLARITY_RISING:  TMR IC polarity rising
 *            @arg TMR_IC_POLARITY_FALLING: TMR IC polarity falling
 *
 * @retval    None
 */
void TMR_ConfigEncodeInterface(TMR_T* tmr, TMR_ENCODER_MODE_T encodeMode, TMR_IC_POLARITY_T ic1Polarity,
                               TMR_IC_POLARITY_T ic2Polarity)
{
    tmr->SMCTRL_B.SMFSEL = BIT_RESET;
    tmr->SMCTRL_B.SMFSEL = encodeMode;

    /** Select the Capture Compare 1 and the Capture Compare 2 as input */
    tmr->CCM1_CAPTURE_B.CC1SEL = BIT_RESET;
    tmr->CCM1_CAPTURE_B.CC2SEL = BIT_RESET;
    tmr->CCM1_CAPTURE_B.CC1SEL = BIT_SET;
    tmr->CCM1_CAPTURE_B.CC2SEL = BIT_SET;

