frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_tmr.c
    tmr->CCEN &= 0xFFFFFF55;
    tmr->CCEN |= (ic1Polarity | ic2Polarity<<4);
}

/*!
 * @brief     Enables Hall sensor interface.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @retval    None
 */
void TMR_EnableHallSensor(TMR_T* tmr)
{
    tmr->CTRL2_B.TI1SEL = ENABLE;
}

/*!
 * @brief     Disable Hall sensor interface.
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @retval    None
 */
void TMR_DisableHallSensor(TMR_T* tmr)
{
    tmr->CTRL2_B.TI1SEL = DISABLE;
}

/*!
 * @brief     Configures the TMR2 TMR3 TMR21 and TMR22 Remapping input capabilities.
 *
 * @param     tmr: The TMRx can be 2 3 21 22
 *
 * @param     remap: specifies the MR input remapping source.
 *            The parameter can be one of the following values:
 *            @arg TMR2_ETR_GPIO            : TMR2 ETR input is connected to GPIO
 *            @arg TMR2_ETR_HSI16           : TMR2 ETR input is connected to HSI16(When RCM_CTRL[HSI16OUTEN]=1)
 *            @arg TMR2_ETR_HSI48           : TMR2 ETR input is connected to HSI48
 *            @arg TMR2_ETR_LSE             : TMR2 ETR input is connected to LSE
 *            @arg TMR2_ETR_COMP2_OUT       : TMR2 ETR input is connected to COMP2_OUT
 *            @arg TMR2_ETR_COMP1_OUT       : TMR2 ETR input is connected to COMP1_OUT
 *            @arg TMR2_TI4_GPIO            : TMR2 T11 input is connected to GPIO
 *            @arg TMR2_TI4_COMP2_OUT       : TMR2 T11 input is connected to COMP2_OUT
 *            @arg TMR2_TI4_COMP1_OUT       : TMR2 T11 input is connected to COMP1_OUT
 *            @arg TMR3_ETR_PE2_PD2         : TMR3 ETR input is connected to PE2 or PD2
 *            @arg TMR3_ETR_HSI48DIV6       : TMR3 ETR input is connected to HSI48 divided by 6(When RCM_CTRL[HSI48DIVEN]=1)
 *            @arg TMR3_TI1_USB_SOF         : TMR3 T11 input is connected to USB_SOF
 *            @arg TMR3_TI1_PE3_PA6_PC6_PB4 : TMR3 T11 input is connected to PE3 PA6 PC6 or PB4
 *            @arg TMR3_TI2_PB5_TMR22_CH2   : TMR3 remap on PB5, TMR22_CH2 selected
 *            @arg TMR3_TI2_PB5_TMR3_CH2    : TMR3 remap on PB5, TMR3_CH2 selected
 *            @arg TMR3_TI4_PC9_USB_NOE     : TMR3 remap on PC9, USB_NOE selected
 *            @arg TMR3_TI4_PC9_TMR3_CH4    : TMR3 remap on PC9, TMR3_CH4 selected
 *            @arg TMR21_ETR_GPIO           : TMR21 ETR input is connected to GPIO
 *            @arg TMR21_ETR_COMP2_OUT      : TMR21 ETR input is connected to COMP2_OUT
 *            @arg TMR21_ETR_COMP1_OUT      : TMR21 ETR input is connected to COMP1_OUT
 *            @arg TMR21_ETR_LSECLK         : TMR21 ETR input is connected to LSECLK
 *            @arg TMR21_TI1_GPIO           : TMR21 T11 input is connected to GPIO
 *            @arg TMR21_TI1_RTC_WKPINT     : TMR21 T11 input is connected to RTC wake up interrupt
 *            @arg TMR21_TI1_HSE_RTC        : TMR21 T11 input is connected to HSE_RTC
 *            @arg TMR21_TI1_MSICLK         : TMR21 T11 input is connected to MSICLK
 *            @arg TMR21_TI1_LSECLK         : TMR21 T11 input is connected to LSECLK
 *            @arg TMR21_TI1_LSICLK         : TMR21 T11 input is connected to LSICLK
 *            @arg TMR21_TI1_COMP1_OUT      : TMR21 T11 input is connected to COMP1_OUT
 *            @arg TMR21_TI1_MCOCLK         : TMR21 T11 input is connected to MCOCLK
 *            @arg TMR21_TI2_GPIO           : TMR21 T12 input is connected to GPIO
 *            @arg TMR21_TI2_COMP2_OUT      : TMR21 T12 input is connected to COMP2_OUT
 *            @arg TMR22_ETR_GPIO           : TMR22 ETR input is connected to GPIO
 *            @arg TMR22_ETR_COMP2_OUT      : TMR22 ETR input is connected to COMP2_OUT
 *            @arg TMR22_ETR_COMP1_OUT      : TMR22 ETR input is connected to COMP1_OUT
 *            @arg TMR22_ETR_LSECLK         : TMR22 ETR input is connected to LSECLK
 *            @arg TMR22_TI1_GPIO           : TMR22 T11 input is connected to GPIO
 *            @arg TMR22_TI1_COMP2_OUT      : TMR22 T11 input is connected to COMP2_OUT
 *            @arg TMR22_TI1_COMP1_OUT      : TMR22 T11 input is connected to COMP1_OUT
 *
 * @retval    None
 */
void TMR_ConfigRemap(TMR_T* tmr, uint32_t remap)
{
    tmr->OPT = remap;
}

/*!
 * @brief     Configure the TI1 as Input
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     icPolarity: TMR_IC_POLARITY_T
 *
 * @param     icSelection: TMR_IC_SELECTION_T
 *
 * @param     icFilter: This parameter must be a value between 0x00 and 0x0F
 *
 * @retval    None
 */
static void TI1Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter)
{
    uint16_t tmpchctrl = 0;

    tmr->CCEN_B.CC1EN = BIT_RESET;

    tmr->CCM1_CAPTURE_B.CC1SEL = BIT_RESET;
    tmr->CCM1_CAPTURE_B.IC1F = BIT_RESET;
    tmr->CCM1_CAPTURE_B.CC1SEL = icSelection;
    tmr->CCM1_CAPTURE_B.IC1F = icFilter;

    tmr->CCEN_B.CC1POL = BIT_RESET;
    tmr->CCEN_B.CC1NPOL = BIT_RESET;
    tmr->CCEN_B.CC1EN = BIT_SET;
    tmpchctrl = tmr->CCEN;
    tmpchctrl |= icPolarity;
    tmr->CCEN = tmpchctrl;
}

/*!
 * @brief     Configure the TI2 as Input
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3 21 22
 *
 * @param     icPolarity: TMR_IC_POLARITY_T
 *
 * @param     icSelection: TMR_IC_SELECTION_T
 *
 * @param     icFilter: This parameter must be a value between 0x00 and 0x0F
 *
 * @retval    None
 */
static void TI2Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter)
{
    uint16_t tmpchctrl = 0;

    tmr->CCEN_B.CC2EN = BIT_RESET;

    tmr->CCM1_CAPTURE_B.CC2SEL = BIT_RESET;
    tmr->CCM1_CAPTURE_B.IC2F = BIT_RESET;
    tmr->CCM1_CAPTURE_B.CC2SEL = icSelection;
    tmr->CCM1_CAPTURE_B.IC2F = icFilter;

    tmr->CCEN_B.CC2POL = BIT_RESET;
    tmr->CCEN_B.CC2NPOL = BIT_RESET;
    tmr->CCEN_B.CC2EN = BIT_SET;
    tmpchctrl = tmr->CCEN;
    tmpchctrl |= icPolarity;
    tmr->CCEN = tmpchctrl;
}

/*!
 * @brief     Configure the TI3 as Input
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     icPolarity: pointer to a TMR_IC_POLARITY_T
 *
 * @param     icSelection: pointer to a TMR_IC_SELECTION_T
 *
 * @param     icFilter: This parameter must be a value between 0x00 and 0x0F
 *
 * @retval    None
 */
static void TI3Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter)
{
    uint16_t tmpchctrl = 0;

    tmr->CCEN_B.CC3EN = BIT_RESET;

    tmr->CCM2_CAPTURE_B.CC3SEL = BIT_RESET;
    tmr->CCM2_CAPTURE_B.IC3F = BIT_RESET;
    tmr->CCM2_CAPTURE_B.CC3SEL = icSelection;
    tmr->CCM2_CAPTURE_B.IC3F = icFilter;

    tmr->CCEN_B.CC3POL = BIT_RESET;
    tmr->CCEN_B.CC3NPOL = BIT_RESET;
    tmr->CCEN_B.CC3EN = BIT_SET;
    tmpchctrl = tmr->CCEN;
    tmpchctrl |= icPolarity;
    tmr->CCEN = tmpchctrl;
}

/*!
 * @brief     Configure the TI4 as Input
 *
 * @param     tmr: Select TMRx peripheral, The x can be 2 3
 *
 * @param     icPolarity: pointer to a TMR_IC_POLARITY_T
 *
 * @param     icSelection: pointer to a TMR_IC_SELECTION_T
 *
 * @param     icFilter: This parameter must be a value between 0x00 and 0x0F
 *
 * @retval    None
 */
static void TI4Config(TMR_T* tmr, uint16_t icPolarity, uint16_t icSelection, uint16_t icFilter)
{
    uint16_t tmpchctrl = 0;

    tmr->CCEN_B.CC4EN = BIT_RESET;

    tmr->CCM2_CAPTURE_B.CC4SEL = BIT_RESET;
    tmr->CCM2_CAPTURE_B.IC4F = BIT_RESET;
    tmr->CCM2_CAPTURE_B.CC4SEL = icSelection;
    tmr->CCM2_CAPTURE_B.IC4F = icFilter;

    tmr->CCEN_B.CC4POL = BIT_RESET;
    tmr->CCEN_B.CC4NPOL = BIT_RESET;
    tmr->CCEN_B.CC4EN = BIT_SET;
    tmpchctrl = tmr->CCEN;
    tmpchctrl |= icPolarity;
    tmr->CCEN = tmpchctrl;
}

/**@} end of group TMR_Fuctions*/
/**@} end of group TMR_Driver*/
/**@} end of group Peripherals_Library*/
